import * as Yup from 'yup';

const loginSchema = Yup.object().shape({
  email: Yup.string()
    .min(
      10,
      'Електронна пошта занадто коротка - має містити мінімум 10 символів.'
    )
    .max(
      63,
      'Електронна пошта занадто довга - має містити максимум 63 символів.'
    )
    .email('Невалідна пошта')
    .matches(
      /^(\w+([.-]?\w+){1,})*@\w+([.-]?\w+)*(.\w{2,3})+$/,
      'Будь ласка введіть валідну адресу електронної пошти'
    )
    .required("Електронна пошта є обов'язковим полем"),
  password: Yup.string()
    .min(7, 'Пароль занадто короткий - має містити мінімум 7 символів.')
    .max(32, 'Пароль занадтно довгий - має містити максимум 32 символи.')
    .matches(
      /^\d*(?=.*[a-z])(?=.*[A-Z])\S+\D*\d*$/,
      'Пароль має містити лише: великі літери, маленькі літери та цифри'
    )
    .required("Пароль є обов'язковим полем"),
});

export default loginSchema;
