import * as Yup from 'yup';

const updatePasswordSchema = Yup.object().shape({
  oldPassword: Yup.string()
    .required()
    .min(7, 'Пароль занадто короткий - має містити мінімум 7 символів.')
    .max(32, 'Пароль занадто довгий - має містити максимум 32 символи.')
    .required("Це поле є обов'язковим")
    .matches(
      /^\d*(?=.*[a-z])(?=.*[A-Z])\S+\D*\d*$/,
      'Пароль має містити лише: великі літери латиницею, маленькі літери латиницею та цифри'
    ),
  newPassword: Yup.string()
  .required("Це поле є обов'язковим")
  .min(7, 'Пароль занадто короткий - має містити мінімум 7 символів.')
    .max(32, 'Пароль занадто довгий - має містити максимум 32 символи.')
    .matches(
      /^\d*(?=.*[a-z])(?=.*[A-Z])\S+\D*\d*$/,
      'Пароль має містити лише: великі літери латиницею, маленькі літери латиницею та цифри'
    ),
  confirmPassword: Yup.string()
  .required("Це поле є обов'язковим")
  .oneOf([Yup.ref('newPassword'), ''], 'Паролі мають співпадати!'),
});

export default updatePasswordSchema;
