import * as Yup from 'yup';
import { Categories } from 'helpers/constants';

const createAndUpdateVacancySchema = Yup.object().shape({
  category: Yup.mixed<Categories>()
    .oneOf(Object.values(Categories))
    .required("Категорія вакансії є обов'язковим полем"),
  title: Yup.string()
    .matches(
      /^(?![-' ]+$)[a-zA-Zа-яА-ЯіІїЇєЄ0-9-'‘ʼ,./ ]+$/,
      'Заголовок вакансії повинен містити тільки: літери, цифри, дефіси та апостроф'
    )
    .min(
      5,
      'Заголовок вакансії занадто короткий - має містити мінімум 5 символів '
    )
    .max(
      30,
      'Заголовок вакансії занадто довгий - має містити максимум 30 символів '
    )
    .required("Заголовок вакансії є обов'язковим полем"),
  description: Yup.string()
    .min(
      10,
      'Опис вакансії занадто короткий - має містити мінімум 10 символів '
    )
    .max(
      120,
      'Опис вакансії занадто довгий - має містити максимум 120 символів '
    )
    .required("Опис вакансії є обов'язковим полем"),
  sallary: Yup.string()
    .min(
      4,
      'Поле заробітної плати  занадто коротке - має містити мінімум 4 символи '
    )
    .max(
      15,
      'Поле заробітної плати занадто довге - має містити максимум 15 символів '
    )
    .matches(
      /^\d+(-\d+)*$/,
      'Поле заробітної плати може містити тільки числа та дефіс між ними без пробілів'
    )
    .required("Заробітня плата є обов'язковим полем"),
  education: Yup.string()
    .max(60, 'Поле освіти занадто довге - має містити максимум 120 символів ')
    .required("Освіта є обов'язковим полем"),
  contactMail: Yup.string()
    .min(
      10,
      'Контактна пошта занадто коротка - має містити мінімум 10 символів.'
    )
    .max(
      63,
      'Контактна пошта занадто довга - має містити максимум 63 символів.'
    )
    .email('Невалідна пошта')
    .matches(
      /^(\w+([.-]?\w+){1,})*@\w+([.-]?\w+)*(.\w{2,3})+$/,
      'Будь ласка введіть валідну адресу контактної пошти'
    )
    .required("Контактна пошта є обов'язковим полем"),
  contactPhone: Yup.string()
    .matches(
      /^\+380\d{9}$/,
      'Контактний номер повинен починатись з "+380" та містити 9 цифр після коду країни'
    )
    .required("Контактний телефон є обов'язковим полем"),
  workExperienceRequired: Yup.string()
    .matches(
      /^\d+(-\d+)*$/,
      'Поле необхідного досвіду роботи може містити тільки числа та дефіс між ними без пробілів'
    )
    .required("Необхідний досвід є обов'язковим полем"),
  location: Yup.string()
    .min(
      3,
      'Місце розташування занадто коротке - має містити мінімум 3 символи.'
    )
    .max(
      60,
      'Місце розташування занадто довге - має містити максимум 60 символів.'
    )
    .matches(
      /^([a-zA-Z-А-Яа-яЁёЇїІіЄєҐґ',]+)*$/,
      'Місце розташування має містити тільки літери без пробілів'
    )
    .required("Місце розташування є обов'язковим полем"),
});

export default createAndUpdateVacancySchema;
